Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །ཁྱོད་ཀྱིས་གཟིགས་སམ་ཁྱོད་ནི་བདག་ལ་མྱུར་དུ་གསུངས།
en: Did you see My Manoharā? May you tell me quickly!’

source: །དེ་ནས་དྲང་སྲོང་དེས་གཞོན་ནུ་ནོར་བཟངས་ལ་བྱོན་པ་ལེགས་སོ་ཞེས་བྱས་པ་དང་། སྟན་བཏིང་བ་བྱ་བ་ལ་སོགས་པ་སྔར་བྱ་བའི་ཡང་དག་པར་དགའ་བ་བྱས་ནས་སྨྲས་པ།
en: “Then the ṛṣi said ‘Welcome’ to Prince Sudhana, made the salutation to be made first, giving him a seat and so forth, and said:

source: སྨིན་མ་འཇམ་པའི་སྨིན་མཚུངས་མཐོན་མཐིང་བཞིན་ལེགས་མཐོང་ན་དགའ་བའི་གཟུགས་འཆང་བ།
en: “ ‘I did see her, whose eyebrows were soft and dark colored, whose appearance was pleasant to behold and agreeable,

source: །བཞིན་རས་ཟླ་བ་ཉ་འདྲ་ཨུཏྤལ་སྔོན་པོ་ལྟ་བུའི་མིག་དེ་བདག་གིས་མཐོང་།
en: Whose face was just like the full moon and whose eyes were just like blue utpalas.

source: །དཔོན་ཁྱོད་བག་རྐྱང་བཞུགས་ཏེ་རྩ་བ་འབྲས་བུ་སྣ་ཚོགས་གསོལ་བར་མཛོད་ཅིག་དང་། །སླད་ཀྱིས་བདེ་བླག་བྱོན་འགྱུར་འདི་ལ་བདག་གི་ཡིད་ལ་ཐེ་ཚོམ་ཡོང་མ་མཆིས།
en: Sir, you should relax your mind and eat various roots and fruits, Which will later keep you going. There is no doubt in my mind about this.

source: །སྨིན་མ་བཟང་མོས་འདི་སྐད་ཚིག་སྨྲས་ཏེ།
en: “ ‘The woman with beautiful eyebrows said this:

source: །གཞོན་ནུ་ཁྱོད་ལ་སྲེད་པས་བདག་མི་བདེ།
en: “Prince, I am distressed with craving for you.

source: །ནགས་ཁྲོད་གནས་པའང་སྡུག་བསྔལ་ཆེན་པོ་སྟེ།
en: Those who live in the forest suffer greatly, too.

source: །གཤེགས་པར་གྱུར་ན་ངེས་པར་བདག་མཐོང་ངོ་།
en: If you proceed, certainly you will see me.”

source: །དེས་སོར་གདུབ་རྒྱན་འདི་བྱིན་ནས་སྨྲས་པ། ལམ་ཡང་ལ་བགྲོད་དཀའ་བས་ཉོན་མོངས་པར་འགྱུར་གྱིས་སླར་ལོག་ཤིག །གལ་ཏེ་བཟློག་ཀྱང་འདུག་ཏུ་མ་བཏུབ་ན་དེ་ལ་ལམ་བསྟན་པའི་རིགས་སོ། །དེས་ཡང་འདི་སྐད་ཅེས་བསྟན་ཏེ།
en: “ ‘She gave me this ring and said, “Say to him, ‘The way is difficult and exhausting. Turn back.’ If he cannot turn back, you should tell him the way.” Then, she said this:

source: བྱང་ཕྱོགས་ལོགས་ན་རི་ནག་པོ་གསུམ་ཡོད་དོ། །དེ་དག་རྒལ་བའི་ཕ་རོལ་ན་ཡང་གསུམ། དེ་དག་རྒལ་བའི་ཕ་རོལ་ན་ཡང་གསུམ་ཡོད་དེ།
en: “There are three black mountains in the north, another three beyond them, and another three beyond them.

source: དེ་དག་རྒལ་བ་དང་རིའི་རྒྱལ་པོ་གངས་ཅན་ཞེས་བྱ་བ་ཡོད་དེ།
en: And then beyond them, there is the Himalaya, the king of mountains.

source: ཕྱོགས་དེ་ནས་སྨན་འདི་དག་བླང་བར་བྱ་སྟེ།
en: “ ‘ “You should obtain these medicines from that place.

source: འདི་ལྟ་སྟེ་ཤིན་ཏུ་འོ་མ་འཛག་ཅེས་བྱ་བའི་སྨན་ཡོད་དེ། དེ་མར་ལས་བཙོས་ནས་བཏུང་བར་བྱའོ།
en: There is a medicine called sūdayā; you should boil it with ghee and drink it.

source: །དེས་ན་སྐོམ་པ་དང་བཀྲེས་པ་མེད་ཅིང་དྲན་པ་དང་མཐུ་སྟོབས་འཕེལ་བར་འགྱུར་རོ།
en: This will free you from thirst and hunger and improve your memory and physical strength.

source: །སྤྲེའུ་ཞིག་ཀྱང་བཀྲི་བར་བྱ།
en: You should also look for a monkey.

source: གསང་སྔགས་དག་ཀྱང་བསླབ་པར་བྱ།
en: You should also learn mantras.

source: གཞུ་མདའ་དང་ཆས་པ་དང་། ནོར་བུ་འོད་དང་ལྡན་པ་དང་། དུག་གསོད་པ་སྨན་དུག་སེལ་དང་། ལྕགས་ཀྱི་ཕུར་པ་གསུམ་དང་། པི་བང་ཡང་བཅང་བར་བྱའོ།
en: You should have a bow and arrows, luminous jewels, an antidote to counteract the effects of poison, three iron wedges, and a lute.

source: །རིའི་རྒྱལ་པོ་གངས་ཅན་གྱི་བྱང་ཕྱོགས་ན་རི་བོ་ཕུར་པའི་རྩེ་ཡོད་དོ། །དེ་ནས་ལམ་ཆུ་སྒྲ་ཅན་དང་། སེང་ལྡེང་ཅན་དང་། རྒྱུད་གཅིག་པ་དང་། རྡོ་རྗེ་ཅན་དང་། འདོད་དགུར་སྒྱུར་བའི་གཟུགས་ཅན་དང་། ཕུར་པའི་དབྱིབས་དང་། ས་སྲུང་བུའི་དབྱིབས་དང་། མི་གཡོ་བ་དང་། རབ་གྲོལ་ལོ།
en: “ ‘ “To the north of the Himalaya, the king of mountains, lies Mount Utkīlaka, and Kūjaka Jalapatha, Khadiraka, Ekadhāraka, Vajraka, Kāmarūpin, Utkīlaka, Airāvataka, Avevāṇa, and Pramokṣa.

source: །ཁྱོད་ཀྱིས་རི་དེ་དག་རྒལ་དགོས་ཏེ།
en: You have to cross these mountains.

source: དེ་ལ་རི་བོ་སེང་ལྡེང་ཅན་ལ་ནི་ཕུག་ནས་འཇུག །
en: Among them, enter Mount Khadiraka through a cave.

source: རྒྱུད་གཅིག་པ་དང་། ཕུར་པའི་དབྱིབས་ལ་ཡང་ཕུག་ནས་འཇུག །རྡོ་རྗེ་ཅན་ལ་ནི་བྱའི་རྒྱལ་པོས་འཇུག་སྟེ།
en: Ekadhāraka and Utkīlaka are also to be entered through caves, and Vajraka by the king of birds.

source: ཐབས་འདི་དག་གིས་རི་བོ་དེ་རྣམས་རྒལ་བར་བྱའོ།
en: You should cross the mountains by these means.

source: །འཁྲུལ་འཁོར་ར་གདོང་ཅན་དང་། ལུག་ལྟ་བུ་དང་། སྐྱེས་བུ་སྲིན་པོ་སེར་སྐྱའི་གཟུགས་ཅན་དག་གཞོམ་པར་བྱའོ།
en: You should defeat the magical contraptions, which are the one with a goat-like face, the one like a sheep, and the man shaped like a yellow rākṣasa.

source: དེ་ནི་ཞོ་ཤས་གཞོམ་པར་བྱའོ།
en: You should destroy it with courage.

source: །བདག་གི་སླད་དུ་གཞུ་བདུངས་ལ།
en: Sitting in the middle of the cave,

source: །མདའ་ཡིས་བསྣུན་ཏེ་གསད་པར་གྱིས།
en: Bend your bow, shoot an arrow, And kill it for me. “ ‘ “When you see two sheep

source: །གང་ལ་ལུག་གཉིས་ཕན་ཚུན་ནས། །རྡུང་བར་བྱེད་པ་མཐོང་ན་ནི།
en: Colliding with one another,

source: །ཕུར་པ་དག་གིས་གདབ་པར་མཛོད།
en: Drive wedges.

source: །མི་བཟད་བསྙེན་པར་དཀའ་བ་ཡི། །གནོད་སྦྱིན་དང་ནི་སྲིན་པོ་དག །གཞུ་བཀང་སྟེ་ནི་གསང་མཛོད་ལ། །ཆུ་སྲིན་འཛིན་ཁྲིས་གང་བ་ཡི།
en: Who are dreadful and difficult to approach.

source: །ཆུ་བོ་མང་པོ་རྒལ་མཛོད་ཅིག །ནང་ག་ཕྱེ་མ་ལབ་གདུངས་དང་། །སྣ་ཚོགས་ངུད་མོ་དགོད་པ་དང་། །སྦྲུལ་ཅན་འོད་མ་ཅན་གྱི་ཀླུང་།
en: “ ‘ “You should cross many rivers Full of crocodiles and alligators, Namely, the Naṅgā, Pataṅgā, Tapanī, Citrā, Rudanī, Hasanī, Āśīviṣā, and Vetranadī.

source: །སྣ་ཚོགས་ཅན་ན་འདོད་སྒྱུར་གཟུགས། །ངུད་མོར་མི་འམ་ཅི་ཡི་བྲན།
en: Beings assuming any shape at will in the Citrā,

source: །དགོད་པ་ན་ནི་མིའམ་ཅིའི།
en: A female servant of kinnarīs in the Rudanī,

source: །ནང་ག་ན་ནི་བརྟན་པར་བྱ།
en: “ ‘ “You should behave confidently in the Naṅgā,

source: །ཕྱེ་མ་ལེབ་ལ་རྟུལ་ཕོད་བྱ།
en: Take courage in the Pataṅgā,

source: །ངུད་མོ་ཅན་དུ་ཡིད་བདེ་བས།
en: The Rudanī with satisfaction,

source: །དགོད་བྱེད་དུ་ནི་མི་སྨྲ་བའི།
en: And the Hasanī in silence.

source: །ཀླུང་དུ་མཚོན་རྣོན་གདབ་པ་ཡི། །སྦྱོར་བས་ཀུན་ཏུ་རྒལ་བར་མཛོད།
en: Striking with a sharp weapon.

source: །ཆུ་བོ་རྣམས་རྒལ་ནས་གཅན་པའི་གནས་ན་གནོད་སྦྱིན་ལྔ་བརྒྱ་ཡོད་པ་དེ་རྣམས་ལ་སྲན་ཚུགས་ཏེ་གཞོམ་པར་མཛོད་ཅིག །དེ་ནས་ནི་མིའམ་ཅིའི་རྒྱལ་པོའི་ཕོ་བྲང་མཆིས་སོ་ཞེས་གསུངས་ཤིག །དེ་ནས་གཞོན་ནུ་ནོར་བཟངས་ཀྱིས་ཇི་སྐད་བསྟན་པའི་སྨན་དང་། གསང་སྔགས་དང་། སྨན་དུག་སེལ་གྱི་སྦྱོར་བ་རྣམས་བཙལ་བའི་ཕྱིར་དྲང་སྲོང་དེའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་སོང་ངོ་།
en: “ ‘ “Having crossed the rivers, with composure defeat the five hundred yakṣas on the lookout. Then, the palace of the king of kinnaras is there.” ’ “And so, in order to look for the medicines, mantras, and antidote as instructed, Prince Sudhana bowed low until his forehead touched the ṛṣi’s feet, and then departed.

source: །དེ་ནས་དེས་སྤྲེའུ་མ་གཏོགས་པར་ཇི་སྐད་བསྟན་པ་ཐམས་ཅད་སྟ་གོན་བྱས་ནས།
en: He prepared everything as instructed except a monkey.

source: དེ་ནས་དེ་རྣམས་ཁྱེར་ཏེ་ཡང་དྲང་སྲོང་དེའི་དྲུང་དུ་སོང་བ་དང་། དེས་དེ་ལ་སྤྲེའུ་བྱིན་ནས་སྨྲས་པ།
en: Then, taking everything with him, he went to the ṛṣi again. The ṛṣi gave him a monkey and said:

source: གཞོན་ནུ་འབད་པ་འདིས་ཅི་བྱ།
en: “ ‘O Prince, what use are these efforts?

source: ཡིད་འཕྲོག་མ་འདིས་ཅི་ཞིག་དགོས།
en: Why is this Manoharā so needed?

source: ཁྱོད་གཅིག་པུ་གྲོགས་མེད་པ་ལུས་གདོན་མི་ཟ་བར་འགྱུར་གྱིས་ཐོང་།
en: You are alone, without any companion. Since you will suffer from physical danger, give this up.’

source: གཞོན་ནུས་སྨྲས་པ། དྲང་སྲོང་ཆེན་པོ་བདག་ནི་གདོན་མི་ཟ་བར་མཆིའོ། །ཅིའི་སླད་དུ་ཞེ་ན།
en: “The prince replied, ‘Great ṛṣi, I will certainly go. Why?

source: མཁའ་ལ་ཟླ་བ་རྒྱུ་བ་གྲོགས་ཤིག་ག་ལས་མཆིས།
en: Where does the moon moving in the sky have a companion?

source: །མཆེ་བའི་མཐུ་སྟོབས་ལྡན་པའི་རི་དགས་གཙོ་བོ་དང་། །མེ་ཡིས་ནགས་སྲེག་པ་ན་གྲོགས་ཤིག་ག་ལས་མཆིས།
en: Where does the king of beasts possessed of the power and strength of its fangs, Or a fire burning the forest, have a companion?

source: །བདག་ལྟ་བུ་ལ་གྲོགས་པོ་མཐུ་ལྡན་ཅི་ཞིག་འཚལ།
en: What is the need for a powerful companion to a man like me?

source: །ཀྱེ་ཅི་རྒྱ་མཚོ་ཆེ་ཆུར་འཇུག་པར་མི་བགྱིའམ།
en: “ ‘Why should I not take to the great ocean?

source: །ཅི་ལགས་སྦྲུལ་གྱིས་ཟིན་ཅེས་གསོ་བར་མི་བགྱིའམ།
en: Why should I not heal myself, when I was bitten by a snake?

source: །སེམས་ཅན་སྤུངས་ཅན་གྱིས་བསྟེན་བརྩོན་འགྲུས་ཆེར་བརྩམས་ཏེ།
en: I will make great efforts, those on which beings of vigor have relied.

source: །གལ་ཏེ་འབད་དེ་མ་རུང་འདི་ལ་ཉེས་པ་མེད།
en: If I fail, having exerted myself, there is no fault in this.’

source: །དེ་ནས་གཞོན་ནུ་ནོར་བཟངས་ཡིད་འཕྲོག་མས་བསྟན་པའི་རྣམ་པ་སྣ་ཚོགས་དང་ཆས་ཏེ་རིམ་གྱིས་རི་དང་། ཆུ་བོ་དང་། ཕུག་དང་གཡངས་ལ་སོགས་པར་སྨན་དང་། གསང་སྔགས་དང་། སྨན་དུག་སེལ་གྱི་སྦྱོར་བས་རྒྱལ་བར་བྱས་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པའི་གྲོང་ཁྱེར་དང་ཉེ་བ་ཞིག་ཏུ་སོན་པ་དང་། གཞོན་ནུས་གྲོང་ཁྱེར་དཔལ་དང་ལྡན་པ་སྐྱེད་མོས་ཚལ་གྱི་ཚལ་མེ་ཏོག་དང་འབྲས་བུ་སྣ་ཚོགས་དང་ལྡན་པས་མཛེས་པར་བྱས་པ།
en: “Thereupon Prince Sudhana departed, carrying everything as instructed by Manoharā. In due course, he conquered mountains, rivers, caves, pits, and so forth, with medicines, mantras, and the antidote, and arrived near the city of Druma, the king of kinnaras. The prince saw the prosperous city adorned with a beautiful park full of various flowers and fruits, inhabited by various birds.

source: བྱ་སྣ་ཚོགས་ཀྱིས་བསྟེན་པ། རྫིང་བུ་དང་། མཚེའུ་རིང་པོ་དང་། གྲུ་བཞི་དང་། མིའམ་ཅི་མོ་རྣམས་ཀྱིས་བསྐོར་བ་དེ་ལ་མིའམ་ཅི་མོ་རྣམས་ཆུ་ལེན་དུ་འོངས་པ་མཐོང་ནས།
en: There were ponds and long square lakes there, where kinnarīs were wandering about.

source: དེས་གཞོན་ནུ་ནོར་བཟངས་ཀྱིས་དེ་རྣམས་ལ་སྨྲས་པ། ཆུ་མང་པོ་འདིས་ཅི་ཞིག་བྱ།
en: When he saw kinnarīs come there to draw water, Prince Sudhana asked them, ‘What are you doing with this much water?’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པའི་སྲས་མོ་ཡིད་འཕྲོག་མ་ཞེས་བགྱི་བ་ཞིག་མཆིས།
en: “They answered, ‘There is a daughter of Druma, the king of kinnaras, who is called Manoharā.

source: དེ་མིའི་ལག་ཏུ་སོན་པར་གྱུར་པས་དེའི་མིའི་དྲི་བཤལ་བ་ལགས་སོ།
en: Since she was caught by human hands, we are going to wash the human smell off her.’

source: །གཞོན་ནུ་ནོར་བཟངས་ཀྱིས་དྲིས་པ། ཅི་བུམ་པ་འདི་དག་ཐམས་ཅད་ཀྱིས་དུས་གཅིག་ཏུ་དེའི་སྟེང་ནས་ལྡུགས་སམ། འོན་ཏེ་རིམ་གྱིས།
en: “ ‘Do you pour water over her from all these jars at once or one by one?’ asked Prince Sudhana.

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། རིམ་གྱིས་སོ།
en: “ ‘One by one,’ they answered.

source: །དེས་བསམས་པ་ཐབས་འདི་བཟང་སྟེ།
en: “He thought, ‘Here is a good device.

source: སོར་གདུབ་ཀྱི་རྒྱ་འདི་བུམ་པ་གཅིག་གི་ནང་དུ་གཞུག་གོ་སྙམ་ནས། དེས་མིའམ་ཅི་མོ་གཅིག་གི་བུམ་པར་མ་ཚོར་བར་བཅུག་ནས་མི་འམ་ཅི་མོ་དེ་ལ་སྨྲས་པ། ཁྱོད་ཀྱི་བུམ་པ་འདིས་ཐོག་མར་ཡིད་འཕྲོག་མ་ལ་ཁྲུས་བྱོས་ཤིག །དེས་བསམས་པ།
en: I will put this signet ring in a jar.’ He put it in a jar held by a certain kinnarī, without being noticed, and said to the kinnarī, ‘Bathe Manoharā first with this jar of yours.’

source: གདོན་མི་ཟ་བར་འདི་ལ་དགོས་པ་ཞིག་ཡོད་པར་འགྱུར་རོ་སྙམ་ནས།
en: “ ‘There is certainly something important to this,’ she thought.

source: དེ་ནས་དེས་བུམ་པ་དེ་ཐོག་མར་ཡིད་འཕྲོག་མའི་སྤྱི་བོར་བླུགས་པ་ལས་ཇི་ཙམ་ན་སོར་གདུབ་ཀྱི་རྒྱ་པང་དུ་ལྷུང་བ་དང་ཡིད་འཕྲོག་མས་དེ་འཕྲིགས་སོ།
en: “When she poured water over Manoharā’s head with that jar first, the signet ring fell on her lap. Manoharā was puzzled by this.

source: །དེ་ནས་མི་འམ་ཅི་མོ་ལ་དྲིས་པ། འདིར་མི་འགའ་ཞིག་མ་འོངས་སམ།
en: She then asked the kinnarī, ‘Has some human come here?’

source: དེས་སྨྲས་པ། མཆིས་སོ།
en: “ ‘Yes, he has,’ she replied.

source: །སོང་ལ་དེ་དབེན་པ་ཞིག་ཏུ་ཞོག་ཤིག །དེས་དེ་ནང་དུ་ཁྲིད་ནས་དབེན་པ་ཞིག་ཏུ་བཞག་གོ།
en: “ ‘Go and conceal him in a hidden place.’ “She took him inside the palace and concealed him in a hidden place.

source: །དེ་ནས་ཡིད་འཕྲོག་མས་ཕའི་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་སྨྲས་པ། ཡབ་གལ་ཏེ་བདག་གི་ཁྱིམ་ཐབ་བགྱིད་པ་གཞོན་ནུ་ནོར་བཟངས་དེ་མཆིས་ན་དེ་ལ་ཁྱོད་ཀྱིས་ཅི་ཞིག་བགྱི། དེས་སྨྲས་པ།
en: Then Manoharā threw herself at her father’s feet and asked, ‘Father, if that Prince Sudhana, who was my husband, comes here, what will you do to him?’ “ ‘He is a human, and I have no use for him,’ he answered.

source: དེ་མི་ཡིན་ཏེ་ཅིར་ཡང་མི་མཁོ་བས་ངས་དེ་དུམ་བུ་བརྒྱར་བྱས་ལ་ཕྱོགས་བཞིར་གཏོར་ཏེ་གཏང་ངོ་།
en: ‘I will tear him asunder and scatter his body in every direction.’

source: །ཡིད་འཕྲོག་མས་སྨྲས་པ། ཡབ་མིར་གྱུར་པས་འདིར་ག་ལ་མཆི།
en: “Manoharā then said to him, ‘Father, how else does a human come here?

source: བདག་ཉིད་དེ་སྐད་མཆི་བར་བས་སོ།
en: I myself told him to do so.’

source: །དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པ་ཀུན་ནས་དཀྲིས་པ་དང་བྲལ་ཏེ།
en: “Then Druma, the king of kinnaras, completely calmed his anger.

source: དེ་ནས་ཀུན་ནས་དཀྲིས་པ་དང་བྲལ་ནས་སྨྲས་པ། གལ་ཏེ་གཞོན་ནུ་དེ་འོངས་ན་ངས་ཁྱོད་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ལ་ནོར་དང་ཡོ་བྱད་མང་པོ་དང་། མི་འམ་ཅི་མོ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཏེ་དེ་ལ་ཆུང་མའི་དོན་དུ་སྦྱིན་ནོ།
en: When he had completely calmed his anger, he said, ‘If the prince comes, I will adorn you with every ornament, surround you with many treasures, requisites, and a thousand kinnarīs, and give you to him.’

source: །དེ་ནས་ཡིད་འཕྲོག་མ་དགའ་བ་དང་། མགུ་བ་དང་། རབ་ཏུ་དགའ་བས་གཞོན་ནུ་ནོར་བཟངས་ལྷའི་རྒྱན་གྱིས་བརྒྱན་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པ་ལ་བསྟན་ཏོ།
en: “Pleased, delighted, and gladdened, Manoharā then adorned Prince Sudhana with divine ornaments and showed him to Druma, the king of kinnaras.

source: །དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པས་གཞོན་ནུ་ནོར་བཟངས་གཟུགས་བཟང་པོ་མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་རྒྱས་པ་མཆོག་དང་ལྡན་པ་མཐོང་ངོ་།
en: Thus Druma, the king of kinnaras, saw Prince Sudhana, well proportioned, attractive, pleasant to behold, and endowed with a perfect complexion.

source: །མཐོང་ནས་ཤིན་ཏུ་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: Upon seeing him, he felt extreme wonder.

source: དེ་ནས་དེ་བགམ་པར་འདོད་ནས་གསེར་གྱི་སྡོང་པོ་བདུན་དང་། ཤིང་ཏ་ལ་བདུན་དང་། རྔ་བོ་ཆེ་བདུན་དང་། ཕག་བདུན་བཙུགས་སོ།
en: Then, intending to test the prince, he set out seven golden trees, seven palm trees, seven drums, and seven boars.

source: །གཞོན་ནུ་ནོར་བཟངས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་ལ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་དེ་དང་དེ་དག་ལ་མཁས་པ་ཡིན་ནོ།
en: “Prince Sudhana was a bodhisattva, and bodhisattvas are experts in the arts and technical skills.

source: །ལྷ་རྣམས་ཀྱང་དེ་དག་ལ་བགེགས་མེད་པར་བྱ་བའི་ཕྱིར་བརྩོན་པར་བྱེད་དོ།
en: Also, the gods make efforts to remove obstacles from them.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གར་དང་། གླུ་དང་པི་བང་དང་། ཁར་རྔ་དང་། ཤིན་ཏུ་སྒྲ་སྙན་དང་། པི་བང་རྒྱུད་གསུམ་པ་དང་། རྫ་རྔ་ལ་སོགས་པ་ལྷ་རྣམས་ཀྱིས་བསྒྲུབས་པའི་སིལ་སྙན་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྒྲའི་ཁྱད་པར་ནི་ཀུན་ནས་འབུད་ཅིང་མིའམ་ཅི་སྟོང་ཕྲག་དུ་མས་ནི་ཡོངས་སུ་བསྐོར་ནས། རལ་གྲི་ཨུཏྤ་ལ་སྔོན་པོའི་འདབ་མ་འདྲ་བ་ཐོགས་ཏེ།
en: And so the bodhisattva danced, sang, and played musical instruments of various sounds provided by deities, such as a lute, gong, harp, three-stringed lute, clay drum, and so forth. Surrounded by thousands of kinnaras, he held a sword just like a blue utpala petal.

source: མི་འམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པ་མཐོང་བར་གསེར་གྱི་སྡོང་པོའི་དྲུང་དུ་སོང་ནས་ཆུ་ཤིང་ལ་གཅོད་པ་བཞིན་དུ་སྡོང་པོ་དེ་དུམ་བུ་དུམ་བུར་གཅད་པར་བརྩམས་ཏེ། དེ་ནས་དེ་ཏིལ་གྱི་འབྲུ་ཙམ་དུ་བརླགས་སོ།
en: Beheld by Druma, the king of kinnaras, he went to a golden tree and cut the tree asunder as if it were a plantain, rendering it into pieces as small as sesame seeds.

source: །མདས་ནི་ཤིང་རྟ་ལ་བདུན་དང་། རྔ་བདུན་དང་། ཕག་བདུན་གཙང་མར་ཕྱུང་སྟེ། རི་རབ་བཞིན་དུ་མི་གཡོ་བར་གནས་སོ།
en: He shot through the seven palm trees, seven drums, and seven boars with an arrow, and stood immovable like Mount Sumeru.

source: །དེ་ནས་ནམ་མཁའ་ལ་གནས་པའི་ལྷ་དང་། མིའམ་ཅི་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཨ་ལ་ལ་ཞེས་ཅ་ཅོ་དང་ག་ཞའི་སྒྲ་ཆེན་པོ་ཕྱུང་ངོ་།
en: Then the gods in the sky and hundreds of thousands of kinnaras let out a great cry of laughter:

source: །མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པས་མཐོང་ཞིང་ཐོས་ནས་ཤིན་ཏུ་ངོ་མཚར་དུ་གྱུར་ཏོ།
en: ‘Hāhā!’ Having seen and heard this, Druma, the king of kinnaras, felt wonder.

source: །དེ་ནས་མིའམ་ཅི་མོ་ཡིད་འཕྲོག་མ་འདྲ་བ་ཤ་སྟག་སྟོང་གི་དབུས་སུ་ཡིད་འཕྲོག་མ་བཞག་སྟེ།
en: Then he had Manoharā mingle with a thousand kinnarīs who looked identical to her and said to Prince Sudhana, ‘O Prince, now find Manoharā.’

source: གཞོན་ནུ་ནོར་བཟངས་ལ་སྨྲས་པ། གཞོན་ནུ་ཚུར་ཡིད་འཕྲོག་མ་ངོ་ཤེས་པར་གྱིས་ཤིག །དེ་ནས་གཞོན་ནུ་ནོར་བཟངས་ཀྱིས་ངོ་ཤེས་པར་བྱ་བའི་ཕྱིར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་སྨྲས་པ།
en: “Prince Sudhana spoke a verse in order to distinguish her from the others: “ ‘If you are my beloved, Manoharā,

source: ཇི་ལྟར་ཁྱོད་ནི་ལྗོན་པའི་བུ་ཡིན་ལ། །ཁོ་བོའི་སྡུག་པ་ཡིད་འཕྲོག་ཡིན་ཞེ་ན།
en: Just as you are the daughter of Druma,

source: །བདེན་པ་འདི་ཡིས་མྱུར་བ་ཁོ་ནར་ནི།
en: By this truth, quick,

source: །ཡིད་འཕྲོག་གོམ་པས་མྱུར་དུ་འགྲོ་བར་ཤོག །དེ་ནས་དེ་མ་ཐག་ཏུ་གོམ་པས་སོང་བ་དང་། མིའམ་ཅི་རྣམས་ཀྱིས་སྨྲས་པ།
en: Manoharā, take a step quickly. “Then she immediately took a step.

source: ལྷ་གཞོན་ནུ་ནོར་བཟངས་འདི་སྟོབས་དང་། བརྩོན་འགྲུས་དང་། ཕ་རོལ་གནོན་པ་ཤིན་ཏུ་ཚོགས་པ་ལགས་ཏེ། ཡིད་འཕྲོག་མ་དང་ཐབ་རིར་བབ་ལགས་ན།
en: The kinnarīs said, ‘Your Majesty, this Prince Sudhana is possessed of power, effort, and courage and is suitable for Manoharā.

source: ཅིའི་སླད་དུ་འདི་ལ་ཐོ་བཙམ།
en: Why do you mock him? Give Manoharā to him.’

source: འདི་ལ་ཡིད་འཕྲོག་མ་སྩོལ་ཅིག །དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པ་མིའམ་ཅིའི་ཚོགས་རྣམས་ཀྱིས་རྗེས་སུ་བསྔགས་པ་དང་། མིའམ་ཅི་རྣམས་ཀྱི་འདུན་པས་གཞོན་ནུ་ནོར་བཟངས་ལ་རྗེ་བཀུར་སྟི་ཆེན་པོ་བྱས་ནས་ཡིད་འཕྲོག་མ་ལྷའི་རྒྱན་རྣམས་ཀྱིས་བརྒྱན་ཏེ་ལག་པ་གཡོན་པས་བཟུང་།
en: “Then, as the kinnaras praised the prince, Druma, the king of kinnaras, in accordance with the kinnaras’ wishes, offered great honor to Prince Sudhana.

source: གསེར་གྱི་བྱ་མ་བུམ་ལག་པ་གཡས་པས་བཟུང་ནས་གཞོན་ནུ་ནོར་བཟངས་ཀྱི་དྲུང་དུ་སོང་སྟེ་སྨྲས་པ། གཞོན་ནུ་ཡིད་འཕྲོག་མ་འདི་མིའམ་ཅི་མོ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཏེ། ཁོ་བོས་ཁྱོད་ཀྱི་ཆུང་མའི་ཕྱིར་བྱིན་གྱིས།
en: He adorned Manoharā with divine ornaments and, holding her with his left hand and taking a golden pitcher in his right hand, went to Prince Sudhana and said, ‘O Prince, I give you this Manoharā surrounded by a thousand kinnarīs, as your wife.

source: མི་རྣམས་ནི་ངོ་མི་རྟག་པ་ཡིན་གྱིས།
en: Although humans are not steadfast, you must not abandon her, no matter what.’

source: ཇི་ལྟར་ཡང་འདི་མ་དོར་ཅིག །ཡབ་བཀའ་བཞིན་འཚལ་ཞེས་གཞོན་ནུ་ནོར་བཟངས་ཀྱིས་མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པ་ལས་མཉན་ནས་མིའམ་ཅིའི་གནས་ཀྱི་ཁང་པ་ན་ཡིད་འཕྲོག་མ་དང་ལྷན་ཅིག་སྐྱེས་པ་མེད་པར་སིལ་སྙན་རྣམས་ཀྱིས་རྩེ་བར་བྱེད།
en: “ ‘Certainly, Father,’ replied Prince Sudhana to Druma, the king of kinnaras. He and Manoharā played, made love, and enjoyed themselves to the accompaniment of musical instruments, without male company, in the residence of the kinnaras.

source: དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་དོ། །དེ་དུས་གཞན་ཞིག་ན་རང་གི་ཡུལ་དྲན་ནས་ཕ་མ་དང་བྲལ་བ་ལས་བྱུང་བའི་སྡུག་བསྔལ་གྱི་མྱ་ངན་གྱིས་གདུངས་པར་གྱུར་ནས་ཡིད་འཕྲོག་མ་ལ་སྨྲས་པ་ཕ་མ་དང་བྲལ་བ་ལས་བྱུང་བའི་སྡུག་བསྔལ་གྱིས་ནོན་པར་གྱུར་ཏོ།
en: “Later, he remembered his own country and grieved with sorrow because of the great pain of separation from his parents.

source: །དེ་ནས་ཡིད་འཕྲོག་མས་དེ་ལྟར་གྱུར་པ་དག་ཕ་ལ་རྒྱས་པར་སྨྲས་སོ། །དེས་སྨྲས་པ།
en: He said to Manoharā, ‘I am overwhelmed by the great pain of separation from my parents.’ “Manoharā then explained in detail to her father what had happened.

source: གཞོན་ནུ་དང་ལྷན་ཅིག་སོང་ལ་མི་རྣམས་ནི་སླུ་བར་བྱེད་པ་ཡིན་གྱིས།
en: He said, ‘Go with the prince. Since humans are deceitful, though, you must be careful.’

source: ཁྱོད་ཀྱིས་བག་ཡོད་པར་གྱིས་ཤིག་དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པས་ནོར་བུ་དང་། མུ་ཏིག་དང་། གསེར་ལ་སོགས་པ་མང་དུ་བརྫངས་ཏེ་བཏང་ནས་དེ་ཡིད་འཕྲོག་མ་དང་ལྷན་ཅིག་ཏུ་སྟེང་གི་ནམ་མཁའི་ལམ་ལ་མིའམ་ཅིའི་ཤུགས་ཀྱིས་ཆས་པ་ན་རིམ་གྱིས་གླང་པོའི་ཁྱིམ་གྱི་གྲོང་ཁྱེར་དུ་ཕྱིན་ནོ།
en: “Thereupon Druma, the king of kinnaras, gave the prince many jewels and pearls and much gold. “The prince flew with Manoharā through the air by the power possessed by kinnaras and arrived in due course at the city of Hastināpura.

source: །དེ་ནས་གླང་པོའི་ཁྱིམ་གྱི་གྲོང་ཁྱེར་རྡོ་བ་དང་། གསེག་མ་དང་། གྱོ་མོ་རྣམས་བསལ་ནས་ཙན་དན་གྱི་ཆུས་ཆག་ཆག་བཏབ། དར་གྱི་ཆུན་འཕྱང་དཔྱངས་རྒྱལ་མཚན་དང་། བ་དན་བཙུགས། ཤིན་ཏུ་དྲི་ཞིམ་པོའི་པོག་པོར་དག་བཤམས། མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་བཀྲམ་སྟེ། དགའ་དགའ་ལྟར་བྱས་སོ།
en: Then the city of Hastināpura was made comfortable by removing stones, pebbles, and gravel, sprinkling sandalwood water, hanging many silk tassels, raising banners and flags, setting sweet-smelling censers out, and scattering flowers.

source: །དེ་ནས་གཞོན་ནུ་མིའི་གཙོ་བོ་སྟོང་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་ཡིད་འཕྲོག་མ་དང་ལྷན་ཅིག་ཏུ་གླང་པོའི་ཁྱིམ་གྱི་གྲོང་ཁྱེར་དུ་ཞུགས་སོ།
en: Surrounded by thousands of human kings, the prince with Manoharā then entered the city of Hastināpura.

source: །དེ་ནས་ལམ་གྱིས་དུབ་པའི་ངལ་བསོས་ནས་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་པ་དག་ཁྱེར་ཏེ་ཕའི་དྲུང་དུ་སོང་ནས་རྒྱལ་པོའི་སྟན་གྱི་གློ་ཞིག་ཏུ་འདུག་སྟེ།
en: After he was fully rested, he went to his father, bringing various treasures.

source: མིའམ་ཅིའི་གྲོང་ཁྱེར་དུ་སོང་བ་དང་འོངས་པ་རྣམས་རྒྱས་པར་སྨྲས་སོ།
en: He sat down by the king’s seat and explained in detail how he had gone to and come back from the city of kinnaras.

source: །དེ་ནས་རྒྱལ་པོ་ནོར་ཅན་གྱིས་འདི་ནི་ཤིན་ཏུ་སྟོབས་དང་། བརྩོན་འགྲུས་དང་། ཕ་རོལ་གནོན་པ་ཅན་ནོ་ཞེས་བྱ་བར་རིག་ནས་རྒྱལ་པོའི་དབང་བསྐུར་བས་དབང་བསྐུར་ཏོ།
en: Thereupon King Dhana knew that he was possessed of power, effort, and courage and anointed him as king.

source: །གཞོན་ནུ་ནོར་བཟངས་ཀྱིས་བསམས་པ། གང་བདག་ཡིད་འཕྲོག་མ་དང་ལྷན་ཅིག་ཚོགས་པ་དང་། རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བ་ཐོབ་པར་གྱུར་པ་འདི་ནི་སྔོན་བྱས་པའི་རྒྱུའི་ཁྱད་པར་ཡིན་གྱིས།
en: “Prince Sudhana thought, ‘It is from a special cause established in the past that I have been united with Manoharā and attained kingship.

source: མ་ལ་ད་ཡང་བདག་གིས་སྦྱིན་པ་དག་ནི་བཏང་། བསོད་ནམས་དག་ནི་བྱའོ་སྙམ་ནས། དེས་གླང་པོའི་ཁྱིམ་གྱི་གྲོང་ཁྱེར་དུ་ལོ་བཅུ་གཉིས་སུ་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་བྱས་སོ།
en: I will now again give donations and make merit.’ He made limitless offerings in the city of Hastināpura for twelve years.

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་གཞོན་ནུ་ནོར་བཟངས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was that prince called Sudhana at that time, on that occasion, was someone else, you should think otherwise.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་རྒྱལ་པོ་ནོར་བཟངས་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: I was the king called Sudhana at that time, on that occasion, when I performed a bodhisattva’s deeds.

source: །ངས་གང་ཡིད་འཕྲོག་མའི་ཕྱིར་སྟོབས་དང་། བརྩོན་འགྲུས་དང་། ཕ་རོལ་གནོན་པ་བསྟན་ནས། ལོ་བཅུ་གཉིས་སུ་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་བྱས་པ་དེས་ངས་བླ་ན་མེད་པའི་བྱང་ཆུབ་མ་ཐོབ་མོད་ཀྱི།
en: I did not attain supreme and complete awakening only because I showed power, effort, and courage for Manoharā and made limitless offerings for twelve years, however;

source: འོན་ཀྱང་སྦྱིན་པ་དེ་དང་། བརྩོན་འགྲུས་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་། རྐྱེན་ཙམ་དང་། ཚོགས་ཙམ་ཡིན་ནོ།
en: these donations and efforts were only a cause, only a condition, only a preparation for supreme and complete awakening.” 10. Viśvantara a. Viśvantara’s Story I

source: བསོད་ནམས་དག་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་ཐམས་ཅད་ཅེས་བྱ་བའི་གྲོང་རྡལ་གྱི་གྲོང་ཁྱེར་ན་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་བཤེས་གཉེན་ཞེས་བྱ་བ་ཞིག་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་སྟེ།
en: Listen to that story. “Great King, once there was a king named Viśvāmitra in a city called Viśvapurī.

source: འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་། མི་མང་པོས་རབ་ཏུ་གང་བ་དང་། འཐབ་པ་དང་། ཐབ་མོ་དང་། ཁྲག་ཁྲུག་དང་། འགྱེད་པ་རྣམས་རབ་ཏུ་ཞི་བ་ཞེས་བྱ་བ་ནས། ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: In accordance with the Dharma, he ruled over the country, which was rich, prosperous, peaceful, abundant in food, and full of many people, where there was no fighting, combat, dispute, strife, . . . .

source: །དུས་གཞན་ཞིག་ན་བཙུན་མོ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་དོ། །དེ་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་དུས་གཞན་ཞིག་ན་བཙུན་མོ་སེམས་ཅན་དང་ལྡན་པར་གྱུར་ཏེ།
en: “One day, he and his consort played, made love, and enjoyed themselves, and thus the consort conceived a child.

source: དེ་ཟླ་བ་བརྒྱད་དམ་དགུ་འདས་ནས་ཁྱེའུ་གཟུགས་བཟང་པོ། མཛེས་པ།
en: After eight or nine months, a boy was born.

source: བལྟ་ན་སྡུག་པ། པགས་པའི་མདོག་གསེར་འདྲ་བ། མགོ་གདུགས་ལྟར་འདུག་པ། དཔུང་པ་རིང་བ། འཕྲལ་བའི་དབྱེས་ཆེ་བ། སྨིན་མ་འཇར་བ། སྣའི་གཟངས་མཐོ་བ་ཞེས་བྱ་བ་ནས། གནས་ལྔ་ལ་བྱང་བར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: He was well proportioned, attractive, pleasant to behold, gold in complexion, with a head like a parasol, long arms, a broad forehead, eyebrows that meet, a prominent nose . . . . He became fully learned in the five arts . . . .
